---
kind: property
id: P:Autodesk.Revit.DB.DividedPath.DisplayNodeNumbers
source: html/dd1df0fb-dd07-7fcd-1a5b-88f9e0c5c3d7.htm
---
# Autodesk.Revit.DB.DividedPath.DisplayNodeNumbers Property

Controls whether the node numbers are shown when the divided path is selected

## Syntax (C#)
```csharp
public bool DisplayNodeNumbers { get; set; }
```

## Remarks
If true the divided path will show the number of each node
 when the divided path is selected.
 If false the node numbers are hidden.